# 6.1 Reading and Writing Data in Text Format

In [2]:
import numpy as np
import pandas as pd

## Basics

In [3]:
!cat pydata-book-3rd-edition/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
!cat pydata-book-3rd-edition/examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv('pydata-book-3rd-edition/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
# 供了自定义列名，覆盖文件内容
pd.read_csv('pydata-book-3rd-edition/examples/ex2.csv', 
            names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
names=['a', 'b', 'c', 'd', 'message']
pd.read_csv('pydata-book-3rd-edition/examples/ex2.csv', 
            names=names, index_col='message')
#   index_col 用于指定哪一列作为 DataFrame 的行索引（index），而不是作为普通的数据列。

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
pd.read_csv('pydata-book-3rd-edition/examples/ex2.csv', 
            names=names, index_col=2)
# 这里的2表示使用第三列（索引从0开始）作为行索引

    a   b   d message
c
3   1   2   4   hello
7   5   6   8   world
11  9  10  12     foo

分层索引实例

In [10]:
!cat pydata-book-3rd-edition/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [11]:
parsed = pd.read_csv('pydata-book-3rd-edition/examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
!cat pydata-book-3rd-edition/examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

没有固定分隔符，如：,

In [15]:
result = pd.read_table('pydata-book-3rd-edition/examples/ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [ ]:
result1 = pd.read_table('pydata-book-3rd-edition/examples/ex3.txt', sep='\s+')
#    - sep="\s+": 匹配任意数量的空白字符（最灵活）
result1

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
result2 = pd.read_fwf('pydata-book-3rd-edition/examples/ex3.txt', sep='\t')
result2

  Unnamed: 0         A         B         C
0        aaa -0.264438 -1.026059 -0.619500
1        bbb  0.927272  0.302904 -0.032399
2        ccc -0.264273 -0.386314 -0.217601
3        ddd -0.871858 -0.348382  1.100491

无用行

In [23]:
!cat pydata-book-3rd-edition/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [27]:
pd.read_csv("pydata-book-3rd-edition/examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

缺失值： NAN，NULL

In [28]:
!cat pydata-book-3rd-edition/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [30]:
result = pd.read_csv('pydata-book-3rd-edition/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
result.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
# na_values 参数可以输入多种类型的值来定义缺失值标识符：
# na_values = [999, -1, 'NaN']
# 
# 常见默认缺失值标识符:
#      - 'NaN', 'nan', 'NA', 'N/A'
#      - 'null', 'NULL', 'None'
#      - '' (空字符串)
#      - 'missing', 'MISSING'
#      - '#N/A', '#N/A N/A', '#NA'

In [ ]:
result = pd.read_csv('pydata-book-3rd-edition/examples/ex5.csv', 
                     na_values={'c':[3, 'NULL']}) # 定义 3 和 'NULL' 为缺失值
result

  something  a   b     c   d message
0       one  1   2   NaN   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

禁用默认 NA 值

In [35]:
result2 = pd.read_csv('pydata-book-3rd-edition/examples/ex5.csv', keep_default_na=False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [ ]:
result2.isna() # 禁用默认 NA 值

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [ ]:
result3 = pd.read_csv('pydata-book-3rd-edition/examples/ex5.csv', 
                      keep_default_na=False, 
                      na_values=['NA'])
result3 # 仅将 'NA' 识别为缺失值

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [45]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

可以为字典中的每一列指定不同的 NA 哨兵：

In [46]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('pydata-book-3rd-edition/examples/ex5.csv', 
            na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Reading Text Files in Pieces

在处理非常大的文件或找出正确的参数集来正确处理大文件时，您可能只想读取文件的一小部分或迭代文件的较小块。

在查看大文件之前，我们先将 pandas 显示设置更紧凑：

In [4]:
pd.options.display.max_rows = 10

In [5]:
result = pd.read_csv('pydata-book-3rd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

如果只想读取少量行（避免读取整个文件），请使用 nrows 指定：

In [6]:
pd.read_csv('pydata-book-3rd-edition/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

要分段读取文件，请将 chunksize 指定为行数：

In [7]:
chunker = pd.read_csv('pydata-book-3rd-edition/examples/ex6.csv', chunksize=1000)
chunker

In [ ]:
tot = pd.Series([], dtype='float64')
for piece in chunker:
    # 从 chunker 中逐块读取 Series
    # 因为 chunker 是TextFileReader 迭代器，所以不能直接应用 dataframe.apply() 方法
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

tot.add(piece['key'].value_counts(), fill_value=0) 语法解析

In [12]:
# 创建一个空的Series，模拟初始的tot
tot = pd.Series([], dtype='int64')
print("初始的tot:")
print(tot)
print()

# 创建第一个数据块piece1
piece1 = pd.DataFrame({'key': ['A', 'B', 'A', 'C', 'B'
  , 'A']})
print("第一个数据块piece1:")
print(piece1)
print() 
# 对piece1的'key'列进行value_counts()
piece1_counts = piece1['key'].value_counts()
print("piece1['key'].value_counts()的结果:")
print(piece1_counts)
print()
# 使用add方法将统计结果加到tot上
tot = tot.add(piece1_counts, fill_value=0)
print("第一次累加后的tot:")
print(tot)
print()

初始的tot:
Series([], dtype: int64)

第一个数据块piece1:
  key
0   A
1   B
2   A
3   C
4   B
5   A

piece1['key'].value_counts()的结果:
key
A    3
B    2
C    1
Name: count, dtype: int64

第一次累加后的tot:
key
A    3.0
B    2.0
C    1.0
dtype: float64

In [14]:
# 创建第二个数据块piece2
piece2 = pd.DataFrame({'key': ['B', 'C', 'C', 'D', 'A'
  ]})
print("第二个数据块piece2:")
print(piece2)
print()
# 对piece2的'key'列进行value_counts()
piece2_counts = piece2['key'].value_counts()
print("piece2['key'].value_counts()的结果:")
print(piece2_counts)
print()
# 再次使用add方法将统计结果加到tot上
tot = tot.add(piece2_counts, fill_value=0)
print("第二次累加后的tot:")
print(tot)
print()

第二个数据块piece2:
  key
0   B
1   C
2   C
3   D
4   A

piece2['key'].value_counts()的结果:
key
C    2
B    1
D    1
A    1
Name: count, dtype: int64

第二次累加后的tot:
key
A    5.0
B    4.0
C    5.0
D    2.0
dtype: float64

In [15]:
# 最后对结果进行排序
tot = tot.sort_values(ascending=False)
print("排序后的最终结果:")
print(tot)

排序后的最终结果:
key
A    5.0
C    5.0
B    4.0
D    2.0
dtype: float64

## Writing Data to Text Format

In [16]:
data = pd.read_csv('pydata-book-3rd-edition/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
data.to_csv('out.csv')

In [ ]:
pd.read_csv('out.csv', index_col=2)
# index_col = 2 表示使用第三列作为行索引

   Unnamed: 0 something   b     c   d message
a
1           0       one   2   3.0   4     NaN
5           1       two   6   NaN   8   world
9           2     three  10  11.0  12     foo

sys 是 Python 标准库之一，用于访问和操作 Python 解释器的某些部分。它提供了与 Python 运行时环境交互的函数和变量。

In [34]:
import sys

data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

写入 sys.stdout，将文本结果打印到控制台而不是文件

In [36]:
data.to_csv('out2.csv', sep='|')
!cat out2.csv

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [ ]:
data.to_csv(sys.stdout, na_rep='NULL')
# na_rep 参数用于指定在输出文件中表示缺失值的字符串。

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [37]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [39]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'], na_rep='NULL')

a,b,c
1,2,3.0
5,6,NULL
9,10,11.0

## Working with Other Delimited Formats

In [40]:
!cat pydata-book-3rd-edition/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [41]:
pd.read_csv('pydata-book-3rd-edition/examples/ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [2]:
import csv

f = open('pydata-book-3rd-edition/examples/ex7.csv')

reader = csv.reader(f)

for line in reader:
    print(line)

f.close()

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [3]:
with open('pydata-book-3rd-edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

header, values = lines[0], lines[1:]

data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

自定义 csv 格式

定义 csv.Dialect 类必须根据目标文件的实际格式来定义，以确保正确解析数据。

In [10]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ','
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

with open('pydata-book-3rd-edition/examples/ex7.csv') as f:
    reader = list(csv.reader(f, dialect=my_dialect))
reader

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [ ]:
with open('out2.csv') as f:
    reader1 = list(csv.reader(f, delimiter=','))
    # 以‘,’作为分隔符识别，所以将整行视为一个字段返回
reader1

[['|something|a|b|c|d|message'],
 ['0|one|1|2|3.0|4|'],
 ['1|two|5|6||8|world'],
 ['2|three|9|10|11.0|12|foo']]

In [ ]:
with open('out2.csv') as f:
    reader2 = list(csv.reader(f, delimiter='|'))
    # 正确识别内容
reader2

[['', 'something', 'a', 'b', 'c', 'd', 'message'],
 ['0', 'one', '1', '2', '3.0', '4', ''],
 ['1', 'two', '5', '6', '', '8', 'world'],
 ['2', 'three', '9', '10', '11.0', '12', 'foo']]

## JSON Data